package com.example.javatasks.expressInterviewTasks.hw.hw2_oop.orders;

/*
Задача 10: Система управления заказами в интернет-магазине
Описание:
Создайте объектно-ориентированную модель для системы управления заказами. Включите следующие ключевые аспекты:
Абстракция:
Реализуйте общую структуру для всех типов товаров и пользователей.
Наследование:
Разные типы товаров (например, электроника, одежда) и пользователей (например, клиент, администратор).
Полиморфизм:
Используйте общий интерфейс для обработки платежей и скидок.
Инкапсуляция:
Скройте детали реализации полей классов, предоставьте доступ через методы.
Дополнительно:
Реализуйте интерфейс для работы с базой данных заказов, используя HashMap.

Требования:
Класс User:
Поля: id, name, email.
Методы: геттеры/сеттеры, displayUserInfo().
Подклассы Customer и Admin:
Customer: добавляет поле cart (корзина), метод для добавления товара в корзину.
Admin: добавляет метод для изменения цены товара.
Класс Product:
Поля: id, name, price.
Абстрактный метод applyDiscount().
Подклассы Electronics и Clothing:
 */
public class Main {
}
